test/stress-test.yaml
config:
  target: "wss://lolitoys.net"
  ensure:
    max: 500 # fail if max response time exceeds 500ms
    maxErrorRate: 1 # fail if error rate exceeds 1%
  socketio:
    transports: ["websocket"]
  processor: "./getData.js"
  phases:
    - duration: 10
      arrivalRate: 5
      arrivalCount: 700
      name: "Sustained max load"
scenarios:
  - engine: "socketio"
    flow:
      - function: "getData"
      - emit:
          channel: "login"
          data: "{{ game }}"
      - think: 3 # do nothing for 5 seconds, then disconnect
      - emit:
          channel: "answer"
          data: "{{ answer }}"
      - think: 1000000 # do nothing for 5 seconds, then disconnect